Autodesk.Revit.DB.Geolocation.Services.CreateGeolocationData
Abstract class used by the ICreateGeolocationServer
The base class provides the storage name, description and extent properties. Base classes provide additional input related to which
request they are processing.